Autodesk.Revit.DB.Dimension.ValueOverride
The text that replaces the segment's value.
Remarks: This property is for use with single-segmment dimensions only.
For multi-segment dimensions use the corresponding properties of the
DimensionSegment class.

Autodesk.Revit.DB.Dimension.Below
The text shown below the segment's value.
Remarks: This property is for use with single-segmment dimensions only.
For multi-segment dimensions use the corresponding properties of the
DimensionSegment class.

Autodesk.Revit.DB.Dimension.FamilyLabel
The family parameter label of the dimension.
Remarks: A dimension only can be labeled to a family parameter in a family document. Multi-segmented linear dimensions
cannot be labeled. To unbind the family parameter, set this property to null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the family parameter's ParameterType is not suitable for this dimension.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when dimension can not be labeled.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when failed to get the BuiltInParameter DIM_LABEL.
Since: 2014